"use client";

export const PrivacyPolicy = () => (
    <div className="prose prose-invert prose-sm max-w-none text-white/70">
        <h2>Политика конфиденциальности</h2>
        <p>
            <strong>
                Последнее обновление: {new Date().toLocaleDateString("ru-RU")}
            </strong>
        </p>

        <p>
            Настоящая Политика конфиденциальности описывает, как обрабатываются
            ваши персональные данные при использовании контактной формы на
            сайте-портфолио Тамерлана Гельгаева (далее — «Сайт»).
        </p>

        <h4>1. Сбор и использование информации</h4>
        <p>
            Через контактную форму собирается информация, которую вы добровольно
            предоставляете, а именно:
        </p>
        <ul>
            <li>Ваше имя</li>
            <li>Ваш Email адрес</li>
            <li>Текст вашего сообщения</li>
        </ul>
        <p>
            Эти данные используются исключительно для того, чтобы связаться с
            вами в ответ на ваш запрос. Данные не используются для маркетинговых
            рассылок и не передаются третьим лицам.
        </p>

        <h4>2. Хранение данных</h4>
        <p>
            Предоставленные вами данные не хранятся на сервере или в базе данных
            Сайта. Они отправляются напрямую на электронную почту владельца
            сайта с помощью сервиса EmailJS и хранятся только в его почтовом
            клиенте.
        </p>

        <h4>3. Безопасность</h4>
        <p>
            Для обеспечения безопасной передачи ваших данных используется сервис
            EmailJS. Однако, ни один метод передачи данных через Интернет не
            является на 100% безопасным.
        </p>

        <h4>4. Ваши права</h4>
        <p>
            Вы имеете право запросить удаление вашей переписки в любое время,
            связавшись со мной по контактным данным, указанным на Сайте.
        </p>

        <h4>5. Изменения в Политике конфиденциальности</h4>
        <p>
            В настоящую Политику конфиденциальности могут вноситься изменения.
            Рекомендуется периодически просматривать эту страницу для получения
            актуальной информации.
        </p>
    </div>
);
