export const servicesData = [
    {
        id: 1,
        title: "Разработка Landing Page (одностраничный сайт)",
        description:
            "Создание стильных, быстрых и адаптивных одностраничных сайтов. Разработка на React, чистом JS/HTML/CSS для эффективного привлечения клиентов.",
        price: "от 3 000 ₽",
    },
    {
        id: 2,
        title: "Многостраничный сайт / интернет-магазин",
        description:
            "Разработка адаптивных многостраничных сайтов и интернет-магазинов. Обеспечу SEO-оптимизацию, удобную навигацию и эффективное представление ваших услуг/товаров.",
        price: "от 9 000 ₽",
    },
    {
        id: 3,
        title: "Разработка веб-приложений",
        description:
            "Разработка сложных интерактивных веб-приложений: CRM, личных кабинетов, SaaS-платформ. Создание кастомных решений на React/Redux для автоматизации процессов и высокой производительности.",
        price: "от 12 000 ₽",
    },
    {
        id: 4,
        title: "Верстка по макету (Figma)",
        description:
            "Точная, адаптивная и кроссбраузерная верстка ваших макетов из Figma, PSD или Sketch. Реализация в чистом HTML/CSS/JS или в виде React-компонентов.",
        price: "от 4 000 ₽",
    },
    {
        id: 5,
        title: "Доработка и поддержка проектов",
        description:
            "Внесение правок, добавление нового функционала и исправление багов для существующих фронтенд-проектов. Работаю преимущественно с React/JS-базой.",
        price: "от 1 000 ₽/час",
    },
    {
        id: 6,
        title: "Frontend Оптимизация",
        description:
            "Комплексное улучшение скорости загрузки сайта, оптимизация кода и ресурсов. Повышение производительности для лучшего пользовательского опыта и SEO-результатов.",
        price: "от 1 500 ₽",
    },
];
